### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [198]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file_to_load)

In [199]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [200]:
purchase_data_df.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

## Player Count

* Display the total number of players

In [201]:
total_players = len(purchase_data_df["SN"].unique())
total_players

576

In [202]:
total_players_df = pd.DataFrame({"Total Players": [total_players]})
total_players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [203]:
purchasing_analysis_df = purchase_data_df[["Purchase ID", "Item ID", "Price"]]
purchasing_analysis_df

     Purchase ID  Item ID  Price
0              0      108   3.53
1              1      143   1.56
2              2       92   4.88
3              3      100   3.27
4              4      131   1.44
..           ...      ...    ...
775          775       60   3.54
776          776      164   1.63
777          777       67   3.46
778          778       92   4.19
779          779       50   4.60

[780 rows x 3 columns]

In [204]:
unique_items = len(purchasing_analysis_df["Item ID"].value_counts())
unique_items

179

In [205]:
average_price = purchasing_analysis_df["Price"].mean()
average_price

3.050987179487176

In [206]:
number_purchases = len(purchasing_analysis_df["Purchase ID"].value_counts())
number_purchases

780

In [207]:
total_revenue = purchasing_analysis_df["Price"].sum()
total_revenue

2379.77

In [208]:
final_total_players_df = pd.DataFrame({"Number of Unique Items": [unique_items],
                                      "Average Price": [average_price],
                                      "Number of Purchases": [number_purchases],
                                      "Total Revenue": [total_revenue]
                                      })
final_total_players_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [209]:
#give the displayed data cleaner formatting (formatted Average Price and Total Revenue with $ and 2 decimals
final_total_players_df["Average Price"] = final_total_players_df["Average Price"].map("${:,.2f}".format)
final_total_players_df["Total Revenue"] = final_total_players_df["Total Revenue"].map("${:,.2f}".format)
final_total_players_df.head()

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [210]:
gender_demo_df = purchase_data_df[["SN", "Gender", "Age"]].drop_duplicates()
gender_demo_df

                SN  Gender  Age
0          Lisim78    Male   20
1      Lisovynya38    Male   40
2       Ithergue48    Male   24
3    Chamassasya86    Male   24
4        Iskosia90    Male   23
..             ...     ...  ...
773         Hala31    Male   21
774     Jiskjask80    Male   11
775     Aethedru70  Female   21
777     Yathecal72    Male   20
778        Sisur91    Male    7

[576 rows x 3 columns]

In [211]:
count = gender_demo_df["Gender"].value_counts()
count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [212]:
unique_demo = len(gender_demo_df["SN"].value_counts())
unique_demo

576

In [213]:
percent_count = count / unique_demo * 100
percent_count

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [214]:
final_gender_demo_df = pd.DataFrame({"Total Count": count,
                                      "Percentage of Players": percent_count
                                    })
final_gender_demo_df

                       Total Count  Percentage of Players
Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722

In [215]:
#give the displayed data cleaner formatting (formatted Percentage of Players with % and 2 decimals
final_gender_demo_df["Percentage of Players"] = final_gender_demo_df["Percentage of Players"].map("{:,.2f}%".format)
final_gender_demo_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [216]:
#Refered to Pokemon module for groupby
purchase_analysis = purchase_data_df.groupby(["Gender"])
purchase_analysis

In [217]:
#https://www.delftstack.com/howto/python-pandas/how-to-get-average-of-a-column-of-a-pandas-dataframe/
average_purchase_price = purchase_analysis["Price"].mean()
average_purchase_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [218]:
total_purchase_price = purchase_analysis["Price"].sum()
total_purchase_price

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [219]:
purchase_count = purchase_analysis["Price"].count()
purchase_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [220]:
average_purchase_person = total_purchase_price / count 
average_purchase_person

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [221]:
final_purchase_analysis_df = pd.DataFrame({"Purchase Count": purchase_count,
                                          "Average Purchase Price": average_purchase_price,
                                           "Total Purchase Value": total_purchase_price,
                                           "Avg Total Purchase per Person": average_purchase_person                                      
                                    })
final_purchase_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [222]:
final_purchase_analysis_df["Average Purchase Price"] = final_purchase_analysis_df["Average Purchase Price"].map("${:,.2f}".format)
final_purchase_analysis_df["Total Purchase Value"] = final_purchase_analysis_df["Total Purchase Value"].map("${:,.2f}".format)
final_purchase_analysis_df["Avg Total Purchase per Person"] = final_purchase_analysis_df["Avg Total Purchase per Person"].map("${:,.2f}".format)
final_purchase_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [223]:
age_demo_df = purchase_data_df[["SN", "Age"]].drop_duplicates()
age_demo_df

                SN  Age
0          Lisim78   20
1      Lisovynya38   40
2       Ithergue48   24
3    Chamassasya86   24
4        Iskosia90   23
..             ...  ...
773         Hala31   21
774     Jiskjask80   11
775     Aethedru70   21
777     Yathecal72   20
778        Sisur91    7

[576 rows x 2 columns]

In [224]:
#referred to the binning (activity 3 module 3)
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 200]

group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [225]:
age_demo_df["Age Group"] = pd.cut(age_demo_df["Age"], bins, labels=group_names, include_lowest=True)
age_demo_df

                SN  Age Age Group
0          Lisim78   20     20-24
1      Lisovynya38   40       40+
2       Ithergue48   24     20-24
3    Chamassasya86   24     20-24
4        Iskosia90   23     20-24
..             ...  ...       ...
773         Hala31   21     20-24
774     Jiskjask80   11     10-14
775     Aethedru70   21     20-24
777     Yathecal72   20     20-24
778        Sisur91    7       <10

[576 rows x 3 columns]

In [226]:
age_group_count = age_demo_df["Age Group"].value_counts()
age_group_count.sort_values()

40+       12
<10       17
10-14     22
35-39     31
30-34     52
25-29     77
15-19    107
20-24    258
Name: Age Group, dtype: int64

In [227]:
age_group_percent = age_group_count / unique_demo * 100
age_group_percent

20-24    44.791667
15-19    18.576389
25-29    13.368056
30-34     9.027778
35-39     5.381944
10-14     3.819444
<10       2.951389
40+       2.083333
Name: Age Group, dtype: float64

In [228]:
final_age_demo_df = pd.DataFrame({"Total Count": age_group_count,
                                    "Percentage of Players Age": age_group_percent,                                     
                                    })
final_age_demo_df

       Total Count  Percentage of Players Age
20-24          258                  44.791667
15-19          107                  18.576389
25-29           77                  13.368056
30-34           52                   9.027778
35-39           31                   5.381944
10-14           22                   3.819444
<10             17                   2.951389
40+             12                   2.083333

In [229]:
final_age_demo_df["Percentage of Players Age"] = final_age_demo_df["Percentage of Players Age"].map("{:,.2f}%".format)
final_age_demo_df

       Total Count Percentage of Players Age
20-24          258                    44.79%
15-19          107                    18.58%
25-29           77                    13.37%
30-34           52                     9.03%
35-39           31                     5.38%
10-14           22                     3.82%
<10             17                     2.95%
40+             12                     2.08%

In [230]:
#sort by the index
#https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.sort_index.html
final_age_demo_df = final_age_demo_df.sort_index()
final_age_demo_df

       Total Count Percentage of Players Age
<10             17                     2.95%
10-14           22                     3.82%
15-19          107                    18.58%
20-24          258                    44.79%
25-29           77                    13.37%
30-34           52                     9.03%
35-39           31                     5.38%
40+             12                     2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [231]:
purchasing_analysis_df = purchase_data_df[["Age", "Price", "Purchase ID"]]
purchasing_analysis_df

     Age  Price  Purchase ID
0     20   3.53            0
1     40   1.56            1
2     24   4.88            2
3     24   3.27            3
4     23   1.44            4
..   ...    ...          ...
775   21   3.54          775
776   21   1.63          776
777   20   3.46          777
778    7   4.19          778
779   24   4.60          779

[780 rows x 3 columns]

In [232]:
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 200]

group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [233]:
purchasing_analysis_df["Age Group"] = pd.cut(purchasing_analysis_df["Age"], bins, labels=group_names, include_lowest=True)
purchasing_analysis_df

C:\Users\Owner-PC\AppData\Local\Temp/ipykernel_28492/3245520852.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  purchasing_analysis_df["Age Group"] = pd.cut(purchasing_analysis_df["Age"], bins, labels=group_names, include_lowest=True)

     Age  Price  Purchase ID Age Group
0     20   3.53            0     20-24
1     40   1.56            1       40+
2     24   4.88            2     20-24
3     24   3.27            3     20-24
4     23   1.44            4     20-24
..   ...    ...          ...       ...
775   21   3.54          775     20-24
776   21   1.63          776     20-24
777   20   3.46          777     20-24
778    7   4.19          778       <10
779   24   4.60          779     20-24

[780 rows x 4 columns]

In [234]:
purchasing_group_count = purchasing_analysis_df["Age Group"].value_counts()
purchasing_group_count.sort_values()

40+       13
<10       23
10-14     28
35-39     41
30-34     73
25-29    101
15-19    136
20-24    365
Name: Age Group, dtype: int64

In [235]:
purchase_analysis_age = purchasing_analysis_df.groupby(["Age Group"])
purchase_analysis_age

In [236]:
average_purchase_price_age = purchase_analysis_age["Price"].mean()
average_purchase_price_age

Age Group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [237]:
total_purchase_price_age = purchase_analysis_age["Price"].sum()
total_purchase_price_age

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [238]:
purchase_count_age = purchase_analysis_age["Price"].count()
purchase_count_age

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Price, dtype: int64

In [239]:
average_purchase_person_age = total_purchase_price_age / age_group_count 
average_purchase_person_age

<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [240]:
final_purchasing_analysis_df = pd.DataFrame({"Purchase Count": purchase_count_age,
                                          "Average Purchase Price": average_purchase_price_age,
                                           "Total Purchase Value": total_purchase_price_age,
                                           "Avg Total Purchase per Person": average_purchase_person_age                                      
                                    })
final_purchasing_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

In [241]:
final_purchasing_analysis_df["Average Purchase Price"] = final_purchasing_analysis_df["Average Purchase Price"].map("${:,.2f}".format)
final_purchasing_analysis_df["Total Purchase Value"] = final_purchasing_analysis_df["Total Purchase Value"].map("${:,.2f}".format)
final_purchasing_analysis_df["Avg Total Purchase per Person"] = final_purchasing_analysis_df["Avg Total Purchase per Person"].map("${:,.2f}".format)
final_purchasing_analysis_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [242]:
#top_spenders_df = purchase_data_df[["SN", "Price"]]
#top_spenders_df

In [243]:
#top_individual = top_spenders_df.groupby(["SN"])
#top_individual

In [244]:
#code below with hashmark was my original code, then I reached out to ask BCS for help and the helper helped me with the below live code
#https://nuvirtdatapt1-ice5461.slack.com/archives/C0306JVQZFB

In [245]:
#purchase_count_SN = top_individual["Price"].count()
purchase_count_SN = purchase_data_df.groupby(["SN"]).count()["Price"].rename("Purchase Count")
purchase_count_SN.sort_values()

SN
Adairialis76    1
Lisovynya38     1
Lisotesta51     1
Lisossanya98    1
Lisossala30     1
               ..
Iri67           3
Aina42          3
Idastidru52     4
Iral74          4
Lisosia93       5
Name: Purchase Count, Length: 576, dtype: int64

In [246]:
#average_purchase_price_SN = top_individual["Price"].mean()
average_purchase_price_SN = purchase_data_df.groupby(["SN"]).mean()["Price"].rename("Average Purchase Price")
average_purchase_price_SN.sort_values()

SN
Alo38             1.00
Aidai61           1.01
Chanirra79        1.01
Isurria36         1.02
Qilalista41       1.02
                  ...
Lirtilsa71        4.94
Ririp86           4.94
Yarithsurgue62    4.94
Chanirrasta87     4.94
Dyally87          4.99
Name: Average Purchase Price, Length: 576, dtype: float64

In [247]:
#total_purchase_price_SN = top_individual["Price"].sum()
total_purchase_price_SN = purchase_data_df.groupby(["SN"]).sum()["Price"].rename("Total Purchase Value")
total_purchase_price_SN.sort_values()

SN
Alo38           1.00
Aidai61         1.01
Chanirra79      1.01
Isurria36       1.02
Irilis75        1.02
               ...
Iskadarya95    13.10
Iral74         13.62
Chamjask73     13.83
Idastidru52    15.45
Lisosia93      18.96
Name: Total Purchase Value, Length: 576, dtype: float64

In [248]:
final_top_spenders = pd.DataFrame({"Purchase Count": purchase_count_SN, "Average Purchase Price": average_purchase_price_SN, "Total Purchase Value": total_purchase_price_SN})
final_top_spenders

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [249]:
# final_top_spenders["Average Purchase Price"] = final_top_spenders["Average Purchase Price"].map("${:,.2f}".format)
# final_top_spenders["Total Purchase Value"] = final_top_spenders["Total Purchase Value"].map("${:,.2f}".format)
# # final_top_spenders_df
# final_top_spenders_df = final_top_spenders_df.loc[:,["Purchase Count", "Average Purchase Price", "Total Purchase Value"]]

In [252]:
final_top_spenders["Average Purchase Price"] = final_top_spenders["Average Purchase Price"].map("${:,.2f}".format)
final_top_spenders.sort_values("Total Purchase Value", ascending=False).head()

             Purchase Count Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                  $3.79                 18.96
Idastidru52               4                  $3.86                 15.45
Chamjask73                3                  $4.61                 13.83
Iral74                    4                  $3.41                 13.62
Iskadarya95               3                  $4.37                 13.10

In [251]:
# top_spenders_df = purchase_data_df[["SN", "Price"]]

# top_individual = top_spenders_df.groupby(["SN"])

# purchase_count_SN = top_individual["Price"].count()

# average_purchase_price_SN = top_individual["Price"].mean()

# total_purchase_price_SN = top_individual["Price"].sum()

# final_top_spenders_df = pd.DataFrame({"Purchase Count": purchase_count_SN,
#                                             "Average Purchase Price": average_purchase_price_SN,
#                                             "Total Purchase Value": total_purchase_price_SN                                      
#                                     })

# final_top_spenders_df["Average Purchase Price"] = final_top_spenders_df["Average Purchase Price"].map("${:,.2f}".format)
# final_top_spenders_df["Total Purchase Value"] = final_top_spenders_df["Total Purchase Value"].map("${:,.2f}".format)

# final_top_spenders_df.sort_values("Total Purchase Value", ascending=False)
# final_top_spenders_df.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [253]:
# most_popular_items_df = purchase_data_df[["Item ID", "Item Name", "Price"]]
# most_popular_items_df

In [254]:
#https://stackoverflow.com/questions/17679089/pandas-dataframe-groupby-two-columns-and-get-counts
# most_popular = most_popular_items_df.groupby(["Item ID", "Item Name"])
# most_popular

In [255]:
purchase_count_by_items = purchase_data_df.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
purchase_count_by_items

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Purchase Count, Length: 179, dtype: int64

In [256]:
purchase_count_by_items_average = purchase_data_df.groupby(["Item ID", "Item Name"]).mean()["Price"].rename("Average Purchase Price")
purchase_count_by_items_average

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Average Purchase Price, Length: 179, dtype: float64

In [257]:
purchase_count_by_items_total = purchase_data_df.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value")
purchase_count_by_items_total

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Total Purchase Value, Length: 179, dtype: float64

In [258]:
final_most_popular_items_df = pd.DataFrame({"Purchase Count": purchase_count_by_items, "Average Purchase Price": purchase_count_by_items_average, "Total Purchase Value": purchase_count_by_items_total})
final_most_popular_items_df

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.2800,5.12
1,Crucifer,4,2.9425,11.77
2,Verdict,6,2.4800,14.88
3,Phantomlight,6,2.4900,14.94
4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
181,Reaper's Toll,5,1.6600,8.30
182,Toothpick,3,4.0300,12.09
183,Dragon's Greatsword,3,1.0900,3.27

In [259]:
# final_most_popular_items_df["Average Purchase Price"] = final_most_popular_items_df["Average Purchase Price"].map("${:,.2f}".format)
# final_most_popular_items_df["Total Purchase Value"] = final_most_popular_items_df["Total Purchase Value"].map("${:,.2f}".format)
# final_most_popular_items_df
# final_most_popular_items_df = final_most_popular_items_df.loc[:,["Purchase Count", "Average Purchase Price", "Total Purchase Value"]]

In [260]:
final_most_popular_items_df["Average Purchase Price"] = final_most_popular_items_df["Average Purchase Price"].map("${:,.2f}".format)
final_most_popular_items_df.sort_values("Purchase Count", ascending=False).head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,50.76
145,Fiery Glass Crusader,9,$4.58,41.22
132,Persuasion,9,$3.22,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,31.77

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [261]:
purchase_count_by_items = purchase_data_df.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")
purchase_count_by_items

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Purchase Count, Length: 179, dtype: int64

In [262]:
purchase_count_by_items_average = purchase_data_df.groupby(["Item ID", "Item Name"]).mean()["Price"].rename("Average Purchase Price")
purchase_count_by_items_average

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Average Purchase Price, Length: 179, dtype: float64

In [263]:
purchase_count_by_items_total = purchase_data_df.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase Value")
purchase_count_by_items_total

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Total Purchase Value, Length: 179, dtype: float64

In [264]:
final_most_profitable_items_df = pd.DataFrame({"Purchase Count": purchase_count_by_items, "Average Purchase Price": purchase_count_by_items_average, "Total Purchase Value": purchase_count_by_items_total})
final_most_profitable_items_df

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.2800,5.12
1,Crucifer,4,2.9425,11.77
2,Verdict,6,2.4800,14.88
3,Phantomlight,6,2.4900,14.94
4,Bloodlord's Fetish,5,1.7000,8.50
...,...,...,...,...
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.2300,50.76
179,"Wolf, Promise of the Moonwalker",6,4.4800,26.88
181,Reaper's Toll,5,1.6600,8.30
182,Toothpick,3,4.0300,12.09
183,Dragon's Greatsword,3,1.0900,3.27

In [265]:
final_most_profitable_items_df["Average Purchase Price"] = final_most_profitable_items_df["Average Purchase Price"].map("${:,.2f}".format)
final_most_profitable_items_df.sort_values("Total Purchase Value", ascending=False).head()

,,Purchase Count,Average Purchase Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,50.76
82,Nirvana,9,$4.90,44.10
145,Fiery Glass Crusader,9,$4.58,41.22
103,Singed Scalpel,8,$4.35,34.80

In [183]:
# final_most_profitable_items_df["Average Purchase Price"] = final_most_profitable_items_df["Average Purchase Price"].map("${:,.2f}".format)
# final_most_profitable_items_df["Total Purchase Value"] = final_most_profitable_items_df["Total Purchase Value"].map("${:,.2f}".format).head()
# final_most_profitable_items_df.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80